#include "TFTModule.h"
#include "ModuleController.h"
//--------------------------------------------------------------------------------------------------------------------------------------
#ifdef USE_TFT_MODULE
void TFTModule::Setup()
{
  // настройка модуля тут
  myTFTMenu.setup();
}
//--------------------------------------------------------------------------------------------------------------------------------------
void TFTModule::Update(uint16_t dt)
{ 
  // обновление модуля тут

  myTFTMenu.update(dt);

}
//--------------------------------------------------------------------------------------------------------------------------------------
bool  TFTModule::ExecCommand(const Command& command, bool wantAnswer)
{
  UNUSED(wantAnswer);
  UNUSED(command);

  return true;
}
//--------------------------------------------------------------------------------------------------------------------------------------
#endif // USE_TFT_MODULE

