#ifndef _DHT_SUPPORT_H
#define _DHT_SUPPORT_H

#if ARDUINO < 100
#include <WProgram.h>
#else
#include <Arduino.h>
#endif
//--------------------------------------------------------------------------------------------------------------------------------------
#include "HumidityGlobals.h"
//--------------------------------------------------------------------------------------------------------------------------------------
typedef enum { DHT_11, DHT_2x } DHTType; // тип датчика, который опрашиваем, поскольку у DHT11 немного другой формат данных
//enum { DHT2x_WAKEUP=1, DHT11_WAKEUP=18 }; // таймауты инициализации для разных типов датчиков
#define DHT2x_WAKEUP 1000 // микросекунды ожидания готовности датчика DHT2*
#define DHT11_WAKEUP 18000 // микросекунды ожидания готовности датчика DHT11
//--------------------------------------------------------------------------------------------------------------------------------------
class DHTSupport
{
  private:
  public:
    DHTSupport();
    HumidityAnswer read(uint8_t pin, DHTType sensorType); // читаем показания с датчика
};
//--------------------------------------------------------------------------------------------------------------------------------------
#endif
