#include "ECModule.h"
#include "ModuleController.h"
//--------------------------------------------------------------------------------------------------------------------------------------
void ECModule::Setup()
{
  // добавляем датчик EC в систему
  State.AddState(StateEC,0);

  // пока делаем ему фейковые показания
  uint16_t fakeEC = 1234;
  State.UpdateState(StateEC,0,(void*)&fakeEC);
}
//--------------------------------------------------------------------------------------------------------------------------------------
void ECModule::Update()
{ 
  // обновление модуля тут

}
//--------------------------------------------------------------------------------------------------------------------------------------
bool  ECModule::ExecCommand(const Command& command, bool wantAnswer)
{
  UNUSED(wantAnswer);
  UNUSED(command);

  return true;
}
//--------------------------------------------------------------------------------------------------------------------------------------


