#pragma once

//--------------------------------------------------------------------------------------------------------------------------------
// Защита от копирования прошивки
//--------------------------------------------------------------------------------------------------------------------------------
//#define PROTECT_ENABLED // закомментировать, если не надо использовать проверку на уникальный идентификатор чипа sam3xe

//--------------------------------------------------------------------------------------------------------------------------------------
// настройки ключа защиты для этого чипа
//--------------------------------------------------------------------------------------------------------------------------------------
#define PROTECT_KEY1 F("53323120")
#define PROTECT_KEY2 F("36193236")
#define PROTECT_KEY3 F("32303920")
#define PROTECT_KEY4 F("30313034")
//--------------------------------------------------------------------------------------------------------------------------------------

// Ключ регистрации для этого контроллера:
// 80EDFCF


// ДЛЯ СБРОСА РЕГИСТРАЦИОННОГО КЛЮЧА (ЕСЛИ НАДО ПРОТЕСТИРОВАТЬ, КАК ВЕДЁТ СЕБЯ НЕЗАРЕГИСТРИРОВАННАЯ ВЕРСИЯ)
// ВВЕСТИ В МОНИТОРЕ ПОРТА СТРОКУ "CTSET=0|ZERO" (без кавычек)
// и жмакнуть ENTER
 

